{"id":23883,"date":"2025-02-13T00:00:00","date_gmt":"2025-02-13T08:00:00","guid":{"rendered":"https:\/\/optimataxrelief.com\/?p=23883"},"modified":"2025-02-13T11:53:28","modified_gmt":"2025-02-13T19:53:28","slug":"what-documents-do-i-need-to-file-my-taxes","status":"publish","type":"post","link":"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/","title":{"rendered":"What Documents Do I Need to File My Taxes? "},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"512\" src=\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/02\/what-documents-needed-file-taxes-25-1024x512.webp\" alt=\"What Documents Do I Need to File My Taxes? \" class=\"wp-image-23884\" srcset=\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/02\/what-documents-needed-file-taxes-25-980x490.webp 980w, https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/02\/what-documents-needed-file-taxes-25-480x240.webp 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" \/><\/figure>\n\n\n\n<p>Filing taxes can be a complicated process, especially if you are unsure which documents you need to have on hand. Missing key paperwork can lead to delays, miscalculations, and even penalties if your tax return is incorrect. Whether you file your own taxes or work with a tax professional, gathering the necessary documents beforehand will help streamline the process and ensure accuracy. The documents required for tax filing vary depending on your financial situation, income sources, and deductions. This guide outlines the essential forms and records you need to collect before filing your tax return, along with explanations of their importance and how they impact your tax liability.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Personal Information<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Before starting the filing process, you must have basic identifying information ready. This includes your Social Security number (SSN) or Individual Taxpayer Identification Number (ITIN), which the IRS uses to track your tax history. If you are filing jointly with a spouse or claiming <a href=\"https:\/\/optimataxrelief.com\/blog\/how-to-file-taxes-if-your-spouse-or-dependent-is-incarcerated\/\" target=\"_blank\" rel=\"noreferrer noopener\">dependents<\/a>, you will also need their SSNs or ITINs. Having a copy of your previous year’s tax return is helpful, especially if your income and deductions are similar. It serves as a reference for any carryover amounts, like capital losses or charitable contributions, and can help ensure consistency in reporting.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Income Documents<\/strong>&nbsp;<\/h2>\n\n\n\n<p>It&#8217;s important to understand what forms you may need based on your income sources. These will depend on how you earn your income. Be sure to report all income in order to avoid IRS penalties, reduce the risk of an audit and ensure compliance with tax laws. Underreporting income — whether from employment, self-employment, investments, or side gigs—can result in fines, interest, and potential legal consequences.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"IRS Notice CP2000: Underreporting Income to the IRS\" width=\"1080\" height=\"608\" src=\"https:\/\/www.youtube.com\/embed\/0PnAUZ6jb8k?feature=oembed\"  allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe>\n<\/div><\/figure>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Wages and Salary<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>If you are an employee, your employer will provide a Form W-2, which reports your earnings, federal and state tax withholdings, and other relevant tax information. Each employer you worked for during the tax year should send you a separate W-2 by January 31. If you changed jobs or worked multiple jobs, ensure you have all the necessary forms before filing. For example, if you worked as a restaurant server and had a second job in retail, you would need W-2s from both employers to accurately report your income.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Investment Income<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>If you earned interest, dividends, or capital gains from stocks, bonds, or mutual funds, you would receive tax forms detailing these earnings. Form 1099-INT reports interest income from bank accounts, Form 1099-DIV reports dividends from investments, and Form 1099-B reports capital gains or losses from selling securities. Form 1099-INT should be available by January 31 and Form 1099-B must be issued by financial institutions by February 15. However, since February 15 falls on a Saturday in 2025, this form is due by February 18. &nbsp;<\/p>\n\n\n\n<p>For instance, if you sold shares of a stock you purchased a few years ago, your broker will issue a Form 1099-B showing the sale price and purchase price, which determines whether you have a capital gain or loss.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Retirement Income<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Retirees receiving pension payments, annuities, or <a href=\"https:\/\/optimataxrelief.com\/blog\/taxes-on-social-security-benefits\/\" target=\"_blank\" rel=\"noreferrer noopener\">Social Security benefits<\/a> will need Form 1099-R for distributions from retirement accounts and Form SSA-1099 for Social Security income. These forms must be provided by January 31. If you withdrew money from an IRA or 401(k), these distributions may be subject to income tax and potential penalties if taken before age 59½.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Rental Income<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>If you own rental properties, you must report rental income and associated expenses. Keep records of rental payments received, maintenance costs, property taxes, and mortgage interest to determine your taxable rental income. Documentation like lease agreements and Form 1098 for mortgage interest (issued by lenders by January 31) will support your deductions.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Other Income Sources<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Other sources of taxable income include alimony received (for divorces finalized before 2019), jury duty pay, gambling winnings, and prizes. Gambling winnings are reported on Form W-2G if they exceed a certain threshold, with issuers required to send the form by January 31. Gambling losses can be deducted up to the amount of winnings if you itemize deductions. &nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Self-Employment and Business Income<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Freelancers, independent contractors, and small business owners must report their self-employment income using Form 1099-NEC. This form is issued by clients who paid you at least $600 during the year and must be provided by January 31. If you earned income through payment platforms like PayPal, Venmo, or other third-party networks, you may receive a Form 1099-K if your transactions exceeded $5,000, with issuers required to send these forms by January 31.&nbsp;<\/p>\n\n\n\n<p>In addition to income documentation, self-employed individuals should keep records of their business expenses, including receipts, invoices, and mileage logs. These expenses help reduce taxable income and can include costs like office supplies, advertising, and home office deductions. &nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Deduction and Credit Documents<\/strong>&nbsp;<\/h2>\n\n\n\n<p>When claiming deductions or tax credits, it is crucial to have the necessary documentation to support your claims. Missing or incomplete records can lead to errors, audits, or missed opportunities for tax savings.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Standard Deduction vs. Itemized Deduction<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Taxpayers have the option to take the <a href=\"https:\/\/optimataxrelief.com\/blog\/ask-phil-should-i-itemize-or-take-the-standard-deduction\/\" target=\"_blank\" rel=\"noreferrer noopener\">standard deduction or itemize their deductions<\/a>. The standard deduction is a fixed amount set by the IRS each year and varies based on filing status. For example, the 2024 standard deductions are:&nbsp;<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Single filers and married individuals filing separately: $14,600 <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Married couples filing jointly: $29,200 <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Heads of household: $21,900 <\/li>\n<\/ul>\n\n\n\n<p>Additionally, taxpayers who are 65 or older and\/or blind are eligible for an extra standard deduction. In 2024, this additional amount is $1,550 for each spouse among joint filers and $1,950 for a single filer or head of household. Many taxpayers opt for the standard deduction because it simplifies the filing process and often results in a lower tax liability.&nbsp;<\/p>\n\n\n\n<p>However, if your deductible expenses exceed the standard deduction amount, itemizing may be the better choice. Common itemized deductions include mortgage interest, state and local taxes, medical expenses, and charitable contributions. To claim itemized deductions, you will need to gather supporting documents such as:&nbsp;<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Form 1098 for mortgage interest (issued by lenders by January 31) <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Property tax statements <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Receipts for charitable donations <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Medical bills and insurance statements <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>State and local tax payment records <\/li>\n<\/ul>\n\n\n\n<p>For example, if a taxpayer has high medical expenses due to a chronic illness and substantial mortgage interest payments, itemizing deductions may significantly reduce taxable income compared to the standard deduction.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Tax Credit Documentation Requirements<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Tax credits can significantly reduce a taxpayer’s overall liability but claiming them requires proper documentation. The documents needed depend on the specific credit being claimed.&nbsp;<\/p>\n\n\n\n<p>For the Child Tax Credit (CTC), taxpayers need the child’s Social Security number, proof of relationship such as a birth certificate, and proof of residency like school records or medical bills. If the Earned Income Tax Credit (EITC) is claimed, income verification documents like W-2s, 1099s, or self-employment records are necessary.&nbsp;<\/p>\n\n\n\n<p>Those claiming education credits, such as the American Opportunity Tax Credit (AOTC) or the Lifetime Learning Credit (LLC), need Form 1098-T from their educational institution, along with receipts for tuition, books, and other qualifying expenses.&nbsp;<\/p>\n\n\n\n<p>For the Premium Tax Credit (PTC), which helps lower health insurance costs through the marketplace, Form 1095-A is required. Homeowners seeking the <a href=\"https:\/\/optimataxrelief.com\/blog\/can-i-claim-an-energy-tax-credit\/\" target=\"_blank\" rel=\"noreferrer noopener\">Energy Efficient Home Improvement Credit<\/a> must retain manufacturer certification statements and receipts for qualifying improvements.&nbsp;<\/p>\n\n\n\n<p>Self-employed individuals claiming the Self-Employed Health Insurance Deduction need proof of premium payments, and those claiming the Credit for Other Dependents must provide identifying details and proof of support for non-child dependents.&nbsp;<\/p>\n\n\n\n<p>Properly maintaining these records ensures compliance and prevents delays in processing tax returns.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Additional Considerations for Business Owners<\/strong>&nbsp;<\/h2>\n\n\n\n<p>If you own a business, the documents you need will depend on your business entity type.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Sole Proprietorship<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Sole proprietors report business income and expenses on Schedule C of their personal tax return. Required documents include:&nbsp;<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Income records (Form 1099-NEC, bank statements, invoices) <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Expense receipts and invoices <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Mileage logs for business travel <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Home office expenses, if applicable <\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Partnerships<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Partnerships file a separate tax return using Form 1065 and issue Schedule K-1 to partners. Essential documents include:&nbsp;<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Partnership agreement <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Business income and expense records <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Capital contribution records <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Schedule K-1 forms for each partner (due March 15) <\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>S Corporations<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>S corporations file Form 1120-S and distribute income to shareholders via Schedule K-1. Shareholders must report this income on their personal returns. Necessary documents include:&nbsp;<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Business income statements <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Payroll records for employee wages <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Dividend distribution records <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Schedule K-1 for shareholders (due March 15) <\/li>\n<\/ul>\n\n\n\n<p>For example, a freelance graphic designer operating as a sole proprietor will need Form 1099-NEC for client payments, a log of business expenses, and documentation for home office deductions. Conversely, an S corporation owner will need payroll records, business income statements, and <a href=\"https:\/\/optimataxrelief.com\/blog\/what-is-schedule-k-1-2\/\" target=\"_blank\" rel=\"noreferrer noopener\">Schedule K-1<\/a> to report their share of the business’s income. When you have your own business, it can be beneficial to speak to a tax professional about your tax filing. A tax professional can help identify deductions and credits that business owners might overlook, ensuring compliance while maximizing tax savings. By seeking expert advice, business owners can avoid costly mistakes and ensure they meet all filing requirements.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Importance of Documentation<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Waiting until you have all the necessary tax documents before filing is crucial to ensuring accuracy and preventing errors on your tax return. Employers, financial institutions, and other entities must provide tax forms by specific deadlines—typically January 31 or February 15—so filing too early could mean missing critical income or deduction information. Submitting an incomplete return may result in having to file an amended return later, potentially delaying refunds or triggering IRS notices. To avoid these complications, it’s best to verify that you have received all expected forms before completing your tax filing.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Tax Help in 2025<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Filing your taxes accurately and efficiently starts with gathering the right documents. Whether you&#8217;re an employee, self-employed, an investor, or a retiree, having the necessary forms and records will help ensure a smooth filing process and maximize potential deductions and credits. Organizing your income documents, expense records, and tax deduction paperwork ahead of time can prevent delays, reduce errors, and even lower your tax bill. If you&#8217;re unsure about which documents you need, consulting a tax professional can provide guidance tailored to your financial situation. Optima Tax Relief is the nation’s leading tax resolution firm with over a decade of experience helping taxpayers with tough tax situations.&nbsp;&nbsp;<\/p>\n\n\n\n<p><strong>If You Need Tax Help, Contact Us Today for a <\/strong><a href=\"https:\/\/app.optimataxrelief.com\/tax-problems\/?t=99&amp;utm_source=otr-blog-post&amp;utm_campaign=blog-cta&amp;adgroup=free-consultation&amp;network=otr-blogl&amp;ad=02-13-2025\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Free Consultation<\/strong><\/a><strong><\/strong>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Filing taxes can be a complicated process, especially if you are unsure which documents you need to have on hand. Missing key paperwork can lead to delays, miscalculations, and even penalties if your tax return is incorrect. Whether you file your own taxes or work with a tax professional, gathering the necessary documents beforehand will [&hellip;]<\/p>\n","protected":false},"author":8,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","footnotes":""},"categories":[102],"tags":[],"class_list":["post-23883","post","type-post","status-publish","format-standard","hentry","category-tax-returns"],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v25.7.1 (Yoast SEO v25.7) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What Documents Do I Need to File My Taxes?  | Optima Tax Relief<\/title>\n<meta name=\"description\" content=\"Read Optima Tax Relief&#039;s guide to what documents you need to file your taxes in 2025, along with how they impact your tax bill.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What Documents Do I Need to File My Taxes? \" \/>\n<meta property=\"og:description\" content=\"Read Optima Tax Relief&#039;s guide to what documents you need to file your taxes in 2025, along with how they impact your tax bill.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/\" \/>\n<meta property=\"og:site_name\" content=\"Optima Tax Relief\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/OptimaTaxRelief\" \/>\n<meta property=\"article:published_time\" content=\"2025-02-13T08:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2025-02-13T19:53:28+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/02\/what-documents-needed-file-taxes-25.webp\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"800\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/webp\" \/>\n<meta name=\"author\" content=\"Elyssa Carlos\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@OptimaTax\" \/>\n<meta name=\"twitter:site\" content=\"@OptimaTax\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Elyssa Carlos\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/\",\"url\":\"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/\",\"name\":\"What Documents Do I Need to File My Taxes?  | Optima Tax Relief\",\"isPartOf\":{\"@id\":\"https:\/\/optimataxrelief.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/02\/what-documents-needed-file-taxes-25-1024x512.webp\",\"datePublished\":\"2025-02-13T08:00:00+00:00\",\"dateModified\":\"2025-02-13T19:53:28+00:00\",\"description\":\"Read Optima Tax Relief's guide to what documents you need to file your taxes in 2025, along with how they impact your tax bill.\",\"breadcrumb\":{\"@id\":\"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/#primaryimage\",\"url\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/02\/what-documents-needed-file-taxes-25.webp\",\"contentUrl\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/02\/what-documents-needed-file-taxes-25.webp\",\"width\":1600,\"height\":800},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/optimataxrelief.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"What Documents Do I Need to File My Taxes? \"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/optimataxrelief.com\/#website\",\"url\":\"https:\/\/optimataxrelief.com\/\",\"name\":\"Optima Tax Relief\",\"description\":\"Tax Relief &amp; Resolution - Trust the Experts at Optima Tax Relief\",\"publisher\":{\"@id\":\"https:\/\/optimataxrelief.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/optimataxrelief.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/optimataxrelief.com\/#organization\",\"name\":\"Optima Tax Relief, LLC\",\"url\":\"https:\/\/optimataxrelief.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg\",\"contentUrl\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg\",\"width\":1,\"height\":1,\"caption\":\"Optima Tax Relief, LLC\"},\"image\":{\"@id\":\"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/OptimaTaxRelief\",\"https:\/\/x.com\/OptimaTax\",\"https:\/\/www.youtube.com\/@OptimaTaxRelief\",\"https:\/\/www.linkedin.com\/company\/optimataxrelief\/\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"What Documents Do I Need to File My Taxes?  | Optima Tax Relief","description":"Read Optima Tax Relief's guide to what documents you need to file your taxes in 2025, along with how they impact your tax bill.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/","og_locale":"en_US","og_type":"article","og_title":"What Documents Do I Need to File My Taxes? ","og_description":"Read Optima Tax Relief's guide to what documents you need to file your taxes in 2025, along with how they impact your tax bill.","og_url":"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/","og_site_name":"Optima Tax Relief","article_publisher":"https:\/\/www.facebook.com\/OptimaTaxRelief","article_published_time":"2025-02-13T08:00:00+00:00","article_modified_time":"2025-02-13T19:53:28+00:00","og_image":[{"width":1600,"height":800,"url":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/02\/what-documents-needed-file-taxes-25.webp","type":"image\/webp"}],"author":"Elyssa Carlos","twitter_card":"summary_large_image","twitter_creator":"@OptimaTax","twitter_site":"@OptimaTax","twitter_misc":{"Written by":"Elyssa Carlos","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/","url":"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/","name":"What Documents Do I Need to File My Taxes?  | Optima Tax Relief","isPartOf":{"@id":"https:\/\/optimataxrelief.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/#primaryimage"},"image":{"@id":"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/#primaryimage"},"thumbnailUrl":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/02\/what-documents-needed-file-taxes-25-1024x512.webp","datePublished":"2025-02-13T08:00:00+00:00","dateModified":"2025-02-13T19:53:28+00:00","description":"Read Optima Tax Relief's guide to what documents you need to file your taxes in 2025, along with how they impact your tax bill.","breadcrumb":{"@id":"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/#primaryimage","url":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/02\/what-documents-needed-file-taxes-25.webp","contentUrl":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/02\/what-documents-needed-file-taxes-25.webp","width":1600,"height":800},{"@type":"BreadcrumbList","@id":"https:\/\/optimataxrelief.com\/blog\/what-documents-do-i-need-to-file-my-taxes\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/optimataxrelief.com\/"},{"@type":"ListItem","position":2,"name":"What Documents Do I Need to File My Taxes? "}]},{"@type":"WebSite","@id":"https:\/\/optimataxrelief.com\/#website","url":"https:\/\/optimataxrelief.com\/","name":"Optima Tax Relief","description":"Tax Relief &amp; Resolution - Trust the Experts at Optima Tax Relief","publisher":{"@id":"https:\/\/optimataxrelief.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/optimataxrelief.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/optimataxrelief.com\/#organization","name":"Optima Tax Relief, LLC","url":"https:\/\/optimataxrelief.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/","url":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg","contentUrl":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg","width":1,"height":1,"caption":"Optima Tax Relief, LLC"},"image":{"@id":"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/OptimaTaxRelief","https:\/\/x.com\/OptimaTax","https:\/\/www.youtube.com\/@OptimaTaxRelief","https:\/\/www.linkedin.com\/company\/optimataxrelief\/"]}]}},"_links":{"self":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts\/23883","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/users\/8"}],"replies":[{"embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/comments?post=23883"}],"version-history":[{"count":1,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts\/23883\/revisions"}],"predecessor-version":[{"id":23885,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts\/23883\/revisions\/23885"}],"wp:attachment":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/media?parent=23883"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/categories?post=23883"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/tags?post=23883"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}