{"id":24719,"date":"2025-06-02T00:00:00","date_gmt":"2025-06-02T08:00:00","guid":{"rendered":"https:\/\/optimataxrelief.com\/?p=24719"},"modified":"2025-06-03T08:50:38","modified_gmt":"2025-06-03T16:50:38","slug":"irs-crypto-enforcement-2025","status":"publish","type":"post","link":"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/","title":{"rendered":"IRS Crypto Enforcement 2025 "},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"512\" src=\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/IRS-crypto-enforcement-2025-0625-1024x512.webp\" alt=\"IRS Crypto Enforcement 2025\" class=\"wp-image-24720\" srcset=\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/IRS-crypto-enforcement-2025-0625-980x490.webp 980w, https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/IRS-crypto-enforcement-2025-0625-480x240.webp 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" \/><\/figure>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<h2 class=\"wp-block-heading\"><strong>Key Takeaways:<\/strong>&nbsp;<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>The IRS’s attempt to treat DeFi platforms as brokers was repealed in April 2025<\/strong>, signaling a major shift away from aggressive regulation of decentralized platforms. <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Congress and the President reversed the broker rule using the Congressional Review Act<\/strong>, curbing the IRS’s ability to apply vague definitions to emerging technologies. <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>The DOJ disbanded its crypto-focused enforcement team and narrowed its scope<\/strong>, now focusing on fraud and criminal intent rather than technical violations of DeFi activity. <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>The SEC also eased its stance<\/strong>, pausing cases that didn’t clearly involve investor harm and aligning with broader pro-innovation sentiment. <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Despite regulatory pullbacks, the IRS still expects taxpayers to address unreported crypto gains<\/strong>, especially from past years, and offers multiple options to resolve liabilities. <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Taxpayers can consider Offers in Compromise, installment plans, or voluntary disclosure<\/strong>, but professional help is strongly recommended due to the complexity of crypto reporting. <\/li>\n<\/ul>\n<\/blockquote>\n\n\n\n<p>Cryptocurrency taxes have always been complicated, but 2025 has taken things to a new level. With rapid shifts in regulation, enforcement, and political priorities, many crypto investors are left wondering what’s next. The IRS spent years working toward expanded oversight of decentralized finance (DeFi) platforms, only to have that effort reversed almost overnight. The repeal of the expanded broker rule in April 2025 is more than just a policy change—it signals a major shift in how crypto will be taxed and enforced moving forward. In this article, we’ll break down what led to this reversal, how the IRS is now approaching enforcement, and what taxpayers can do to get ahead of any unreported crypto gains.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>The Evolving IRS Regulatory Framework<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The IRS’s approach to taxing cryptocurrency—especially in the world of decentralized finance (DeFi)—changed dramatically between late 2024 and mid-2025. A controversial rule was introduced in December, then repealed just a few months later. These changes were rooted in an older law passed in 2021, which gave the IRS more power to regulate digital assets.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>The December 2024 IRS Rule Revision<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>On December 30, 2024, the Treasury Department announced a rule that would have treated DeFi platforms like traditional financial brokers. This meant platforms using smart contracts, liquidity pools, and even Decentralized Autonomous Organization&nbsp;(DAOs) would have to report users’ transactions to the IRS using a form called <a href=\"https:\/\/optimataxrelief.com\/blog\/1099s-explained-types\/\" target=\"_blank\" rel=\"noreferrer noopener\">1099-DA<\/a>.&nbsp;<\/p>\n\n\n\n<p>The goal was to track more crypto activity and close the “tax gap.” But the crypto community pushed back hard. Critics argued that DeFi platforms don’t work like normal companies—many don’t have owners, staff, or offices—so making them report taxes would be nearly impossible and could hurt innovation and privacy in the U.S.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Congressional Review and Overturning of IRS Rules<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>In response to the backlash, Congress stepped in. They used a special law called the Congressional Review Act to cancel the IRS rule. This was done through House Joint Resolution 25 (H.J.Res.25), which said the rule went beyond what the IRS is allowed to do.&nbsp;<\/p>\n\n\n\n<p>President Trump signed the repeal into law on April 10, 2025. This officially removed DeFi platforms from the IRS’s definition of brokers—for now—and signaled a big shift in how the government plans to handle crypto taxes.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>T<\/em><\/strong><strong><em>he $1 Trillion Infrastructure Act and Its Impact<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>These recent changes actually go back to a law passed years earlier. In 2021, the Infrastructure Investment and Jobs Act included a section (80603) that changed the tax code. It gave the IRS broader authority by redefining the word “broker” to include anyone who helps move digital assets for someone else.&nbsp;<\/p>\n\n\n\n<p>Although this 2021 law didn’t specifically mention DeFi, its vague wording opened the door for the IRS to include DeFi platforms in its December 2024 rule. Repealing that rule in 2025 showed that lawmakers weren’t ready to support such a broad interpretation—though future updates are still possible.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>The Role of Key Entities in IRS Crypto Enforcement<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Several government agencies have played a major role in shaping how crypto is enforced and regulated in the U.S. As the IRS rule was repealed in 2025, other parts of the government also adjusted their approach, signaling a broader shift in how crypto, especially DeFi, is treated.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>The Disbanding of the National Cryptocurrency Enforcement Team<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>On April 8, 2025, the Department of Justice (DOJ) announced it was shutting down the National Cryptocurrency Enforcement Team (NCET). This team had been created to focus on crypto-related crime, including things like unregistered exchanges and suspicious DeFi activity.&nbsp;<\/p>\n\n\n\n<p>But in the DOJ’s memo, officials explained that crypto enforcement was being refocused. Instead of targeting how decentralized platforms operate, the DOJ would now concentrate on clear criminal behavior, like fraud, <a href=\"https:\/\/optimataxrelief.com\/blog\/how-to-safeguard-against-tax-scams\/\" target=\"_blank\" rel=\"noreferrer noopener\">scams<\/a>, or using crypto to launder money. This move signaled a step back from going after technical violations in the DeFi space.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Deputy Attorney General Todd Blanche’s Directives<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Deputy Attorney General Todd Blanche followed up with a series of memos outlining a new direction for the DOJ. His guidance emphasized that the government shouldn’t waste resources on DeFi-related enforcement unless there’s real criminal intent.&nbsp;<\/p>\n\n\n\n<p>In his view, enforcement should focus on bad actors rather than innovative platforms that don’t fit the mold of traditional finance. Blanche’s leadership helped narrow the DOJ’s focus to crimes that hurt consumers or threaten national security, rather than cracking down on every corner of the crypto ecosystem.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>The Securities and Exchange Commission’s Stance<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>At the same time, the Securities and Exchange Commission (SEC) began to change course. With new leadership in place, the SEC started reviewing its aggressive stance toward crypto. Plans were introduced to pause or withdraw some enforcement cases, especially those that didn’t clearly involve fraud or investor harm. The goal was to better align with the broader pro-crypto sentiment following the repeal of the IRS rule—and to avoid overregulating technologies that were still evolving.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Best Practices for Negotiating Unreported‑Gain Crypto Tax Liabilities<\/strong>&nbsp;<\/h2>\n\n\n\n<p>If you haven’t reported some of your crypto gains to the IRS, it’s important to know there are ways to address this and settle any tax debt. This section covers practical steps you can take to get your taxes in order and avoid bigger problems down the line.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Assessing Tax Liabilities and Gathering Documentation<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>The first step is figuring out how much you owe. You’ll need to gather all your crypto transaction records—from exchanges, wallets, and any peer-to-peer trades. This can mean downloading CSV files, exporting wallet histories, and tracking trades or token swaps.&nbsp;<\/p>\n\n\n\n<p>Because DeFi activity can be complex, sometimes you’ll have to manually piece together your transaction history. Specialized crypto tax software can help with this, but the IRS mainly wants to see that you’re making a good-faith effort to report your gains accurately.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Offers in Compromise for Crypto Tax Debts<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>If you owe a large amount and can’t afford to pay it all, an <a href=\"https:\/\/optimataxrelief.com\/services\/tax-negotiation\/offer-in-compromise\/\" target=\"_blank\" rel=\"noreferrer noopener\">Offer in Compromise (OIC)<\/a> might be a good option. This program lets you settle your tax debt for less than what you owe if you can prove paying the full amount would cause you serious financial hardship.&nbsp;<\/p>\n\n\n\n<p>To apply, you’ll need to provide detailed financial information to show your income, expenses, and assets. Preparing a strong OIC package usually requires careful documentation and professional help. &nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Installment Agreements and Penalty Abatement Requests<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>If you don’t qualify for an OIC or prefer a simpler option, you can set up an installment plan to pay your debt over time. The IRS often reduces penalties or interest in these cases. You may also request penalty relief if your failure to report was due to reasonable causes, like relying on outdated guidance or losing access to records. Providing a written explanation and supporting documents can help reduce what you owe. &nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Voluntary Disclosure Programs and Streamlined Procedures<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>The IRS offers voluntary disclosure options for taxpayers who want to come forward about unreported crypto gains before being contacted by the IRS. While originally for offshore accounts, these programs now sometimes include crypto. There are also streamlined procedures that can reduce penalties if you show your mistakes were unintentional. These programs usually require amended returns and full disclosure but can protect you from criminal charges.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Engaging Professional Representation<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Crypto taxes are complicated and constantly changing. Working with a tax attorney or enrolled agent who specializes in crypto cases can make a big difference. They can help you negotiate with the IRS, prepare offers or payment plans, and avoid costly mistakes.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Frequently Asked Questions<\/strong>&nbsp;<\/h2>\n\n\n\n<p><strong><em>Q: What are the new tax rules for crypto in 2025?<\/em><\/strong>&nbsp;<\/p>\n\n\n\n<p>A: In April 2025, the IRS rule that classified DeFi platforms as brokers was repealed. While DeFi platforms are no longer required to issue 1099 forms, taxpayers are still responsible for reporting crypto gains, especially from centralized exchanges.&nbsp;<\/p>\n\n\n\n<p><strong><em>Q: How far back can the IRS go for crypto?<\/em><\/strong>&nbsp;<\/p>\n\n\n\n<p>A: The IRS can <a href=\"https:\/\/optimataxrelief.com\/blog\/the-irs-is-auditing-my-crypto-now-what\/\" target=\"_blank\" rel=\"noreferrer noopener\">audit crypto transactions<\/a> up to 3 years back in most cases—but up to 6 years or more if there’s a substantial underreporting or suspected fraud.&nbsp;<\/p>\n\n\n\n<p><strong><em>Q: Will the IRS know if I don&#8217;t report crypto?<\/em><\/strong>&nbsp;<\/p>\n\n\n\n<p>A: Yes, the IRS receives data from centralized exchanges, payment processors, and whistleblowers. Blockchain analysis tools also allow them to track unreported crypto activity.&nbsp;<\/p>\n\n\n\n<p><strong><em>Q: What is the penalty for not reporting crypto?<\/em><\/strong>&nbsp;<\/p>\n\n\n\n<p>A: Penalties can include fines, interest on unpaid taxes, and in severe cases, criminal charges. Civil penalties alone can reach 75% of the unpaid tax due to fraud. In extreme cases, you could face up to 5 years in prison and criminal charges.&nbsp;<\/p>\n\n\n\n<p><strong><em>Q: Do I need to report crypto if I didn&#8217;t sell?<\/em><\/strong>&nbsp;<\/p>\n\n\n\n<p>A: No, if you only bought and held crypto in 2025 without selling, trading, or earning rewards, you generally don’t need to report it. However, any activity generating income (like staking or airdrops) must be reported.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Tax Help for Crypto Investors<\/strong>&nbsp;<\/h2>\n\n\n\n<p>As crypto rules continue to shift, especially after the repeal of recent IRS regulations, it’s more important than ever to stay informed. Even though some reporting requirements were rolled back, the IRS still expects taxpayers to come clean about any unreported gains—especially from past years. If you’ve fallen behind on crypto taxes, don’t wait for the IRS to reach out first. Taking action now gives you more control and can help you avoid steeper penalties later. &nbsp;Optima Tax Relief is the nation’s leading tax resolution firm with over a decade of experience helping taxpayers with tough tax situations.&nbsp;&nbsp;<\/p>\n\n\n\n<p><strong>If You Need Tax Help, Contact Us Today for a <\/strong><a href=\"https:\/\/app.optimataxrelief.com\/tax-problems\/?t=99&amp;utm_source=otr-blog-post&amp;utm_campaign=blog-cta&amp;adgroup=free-consultation&amp;network=otr-blogl&amp;ad=06-02-2025\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Free Consultation<\/strong><\/a>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Cryptocurrency taxes have always been complicated, but 2025 has taken things to a new level. With rapid shifts in regulation, enforcement, and political priorities, many crypto investors are left wondering what’s next. The IRS spent years working toward expanded oversight of decentralized finance (DeFi) platforms, only to have that effort reversed almost overnight. The repeal [&hellip;]<\/p>\n","protected":false},"author":8,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","footnotes":""},"categories":[46],"tags":[],"class_list":["post-24719","post","type-post","status-publish","format-standard","hentry","category-tax-planning"],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v25.7.1 (Yoast SEO v25.7) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>IRS Crypto Enforcement 2025  | Optima Tax Relief<\/title>\n<meta name=\"description\" content=\"IRS crypto enforcement 2025 shifts focus: DeFi broker rule repealed, but taxpayers must still address unreported gains.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"IRS Crypto Enforcement 2025 \" \/>\n<meta property=\"og:description\" content=\"IRS crypto enforcement 2025 shifts focus: DeFi broker rule repealed, but taxpayers must still address unreported gains.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/\" \/>\n<meta property=\"og:site_name\" content=\"Optima Tax Relief\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/OptimaTaxRelief\" \/>\n<meta property=\"article:published_time\" content=\"2025-06-02T08:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2025-06-03T16:50:38+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/IRS-crypto-enforcement-2025-0625.webp\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"800\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/webp\" \/>\n<meta name=\"author\" content=\"Elyssa Carlos\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@OptimaTax\" \/>\n<meta name=\"twitter:site\" content=\"@OptimaTax\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Elyssa Carlos\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/\",\"url\":\"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/\",\"name\":\"IRS Crypto Enforcement 2025  | Optima Tax Relief\",\"isPartOf\":{\"@id\":\"https:\/\/optimataxrelief.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/IRS-crypto-enforcement-2025-0625-1024x512.webp\",\"datePublished\":\"2025-06-02T08:00:00+00:00\",\"dateModified\":\"2025-06-03T16:50:38+00:00\",\"description\":\"IRS crypto enforcement 2025 shifts focus: DeFi broker rule repealed, but taxpayers must still address unreported gains.\",\"breadcrumb\":{\"@id\":\"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/#primaryimage\",\"url\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/IRS-crypto-enforcement-2025-0625.webp\",\"contentUrl\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/IRS-crypto-enforcement-2025-0625.webp\",\"width\":1600,\"height\":800},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/optimataxrelief.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"IRS Crypto Enforcement 2025 \"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/optimataxrelief.com\/#website\",\"url\":\"https:\/\/optimataxrelief.com\/\",\"name\":\"Optima Tax Relief\",\"description\":\"Tax Relief &amp; Resolution - Trust the Experts at Optima Tax Relief\",\"publisher\":{\"@id\":\"https:\/\/optimataxrelief.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/optimataxrelief.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/optimataxrelief.com\/#organization\",\"name\":\"Optima Tax Relief, LLC\",\"url\":\"https:\/\/optimataxrelief.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg\",\"contentUrl\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg\",\"width\":1,\"height\":1,\"caption\":\"Optima Tax Relief, LLC\"},\"image\":{\"@id\":\"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/OptimaTaxRelief\",\"https:\/\/x.com\/OptimaTax\",\"https:\/\/www.youtube.com\/@OptimaTaxRelief\",\"https:\/\/www.linkedin.com\/company\/optimataxrelief\/\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"IRS Crypto Enforcement 2025  | Optima Tax Relief","description":"IRS crypto enforcement 2025 shifts focus: DeFi broker rule repealed, but taxpayers must still address unreported gains.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/","og_locale":"en_US","og_type":"article","og_title":"IRS Crypto Enforcement 2025 ","og_description":"IRS crypto enforcement 2025 shifts focus: DeFi broker rule repealed, but taxpayers must still address unreported gains.","og_url":"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/","og_site_name":"Optima Tax Relief","article_publisher":"https:\/\/www.facebook.com\/OptimaTaxRelief","article_published_time":"2025-06-02T08:00:00+00:00","article_modified_time":"2025-06-03T16:50:38+00:00","og_image":[{"width":1600,"height":800,"url":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/IRS-crypto-enforcement-2025-0625.webp","type":"image\/webp"}],"author":"Elyssa Carlos","twitter_card":"summary_large_image","twitter_creator":"@OptimaTax","twitter_site":"@OptimaTax","twitter_misc":{"Written by":"Elyssa Carlos","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/","url":"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/","name":"IRS Crypto Enforcement 2025  | Optima Tax Relief","isPartOf":{"@id":"https:\/\/optimataxrelief.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/#primaryimage"},"image":{"@id":"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/#primaryimage"},"thumbnailUrl":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/IRS-crypto-enforcement-2025-0625-1024x512.webp","datePublished":"2025-06-02T08:00:00+00:00","dateModified":"2025-06-03T16:50:38+00:00","description":"IRS crypto enforcement 2025 shifts focus: DeFi broker rule repealed, but taxpayers must still address unreported gains.","breadcrumb":{"@id":"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/#primaryimage","url":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/IRS-crypto-enforcement-2025-0625.webp","contentUrl":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/IRS-crypto-enforcement-2025-0625.webp","width":1600,"height":800},{"@type":"BreadcrumbList","@id":"https:\/\/optimataxrelief.com\/blog\/irs-crypto-enforcement-2025\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/optimataxrelief.com\/"},{"@type":"ListItem","position":2,"name":"IRS Crypto Enforcement 2025 "}]},{"@type":"WebSite","@id":"https:\/\/optimataxrelief.com\/#website","url":"https:\/\/optimataxrelief.com\/","name":"Optima Tax Relief","description":"Tax Relief &amp; Resolution - Trust the Experts at Optima Tax Relief","publisher":{"@id":"https:\/\/optimataxrelief.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/optimataxrelief.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/optimataxrelief.com\/#organization","name":"Optima Tax Relief, LLC","url":"https:\/\/optimataxrelief.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/","url":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg","contentUrl":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg","width":1,"height":1,"caption":"Optima Tax Relief, LLC"},"image":{"@id":"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/OptimaTaxRelief","https:\/\/x.com\/OptimaTax","https:\/\/www.youtube.com\/@OptimaTaxRelief","https:\/\/www.linkedin.com\/company\/optimataxrelief\/"]}]}},"_links":{"self":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts\/24719","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/users\/8"}],"replies":[{"embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/comments?post=24719"}],"version-history":[{"count":1,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts\/24719\/revisions"}],"predecessor-version":[{"id":24721,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts\/24719\/revisions\/24721"}],"wp:attachment":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/media?parent=24719"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/categories?post=24719"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/tags?post=24719"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}