{"id":24713,"date":"2025-05-30T12:00:41","date_gmt":"2025-05-30T20:00:41","guid":{"rendered":"https:\/\/optimataxrelief.com\/?p=24713"},"modified":"2025-06-02T09:12:12","modified_gmt":"2025-06-02T17:12:12","slug":"how-long-can-my-state-collect-back-taxes","status":"publish","type":"post","link":"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/","title":{"rendered":"How Long Can My State Collect Back Taxes? "},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"512\" src=\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/how-long-state-collect-back-taxes-0525-1024x512.webp\" alt=\"How Long Can My State Collect Back Taxes? \" class=\"wp-image-24714\" srcset=\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/how-long-state-collect-back-taxes-0525-980x490.webp 980w, https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/how-long-state-collect-back-taxes-0525-480x240.webp 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" \/><\/figure>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<h2 class=\"wp-block-heading\"><strong>Key Takeaways:<\/strong>&nbsp;<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Each state sets its own statute of limitations for tax assessment and collection, typically ranging from 6 to 20 years, but some allow indefinite collection if no return is filed or fraud is suspected. <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The statute of limitations for assessment begins when a return is filed, while the collection period begins once tax is officially assessed. <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Unfiled or fraudulent tax returns often result in no statute of limitations at all, allowing states to pursue collection at any time. <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Entering a payment plan or filing for bankruptcy can pause or extend the statute of limitations, depending on state-specific rules. <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>States like California and New York have some of the longest collection windows—20 years—and aggressively pursue tax debts. <\/li>\n<\/ul>\n\n\n\n<ul class=\"wp-block-list\">\n<li>To determine your state&#8217;s rules, check with the Department of Revenue or consult a tax professional for accurate guidance. <\/li>\n<\/ul>\n<\/blockquote>\n\n\n\n<p>Owing back taxes is never a pleasant situation, but it’s even more stressful when you&#8217;re unsure how long the state has to collect those taxes. While the IRS has fairly standardized time limits, the rules for state-level tax collection vary widely—and in some cases, the clock might never stop ticking. Understanding how long your state can collect back taxes is crucial for protecting your financial future and avoiding unexpected enforcement actions. In this article, we’ll explore the statutes of limitations for state tax collection, highlight exceptions that could extend the timeline, and provide a detailed breakdown of collection periods across all 50 states and the District of Columbia.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Are State Back Taxes?<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Back taxes are taxes that were not paid by their due date. This can happen when a taxpayer doesn&#8217;t file a return, underreports income, miscalculates their liability, or simply doesn’t pay the full amount due. While some back taxes are the result of honest mistakes, others stem from more serious issues such as tax evasion or fraud.&nbsp;&nbsp;<\/p>\n\n\n\n<p>State back taxes specifically refer to unpaid income taxes or business taxes owed to a state government, as opposed to federal taxes owed to the IRS. Since each state has its own tax agency and enforcement process, the rules for assessing and collecting these unpaid taxes are determined at the state level.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Understanding the Statute of Limitations<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The statute of limitations is a legal time limit that defines how long a government agency has to take specific actions. In the context of taxes, there are typically two different types of statutes: one for assessing additional tax and another for collecting that tax once assessed.&nbsp;&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Assessment vs. Collection Periods<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>It’s important to distinguish between the statute of limitations for assessment and that for collection. The assessment period is how long the state has to identify and formally record additional tax owed after a return is filed. Once the tax has been assessed, the collection period refers to how long the state has to collect the money from you through enforced measures such as wage garnishment, liens, or levies.&nbsp;<\/p>\n\n\n\n<p>For example, if your state has a three-year assessment period and a ten-year collection period, it must assess your tax liability within three years of when you filed the return. If it does so, it then has ten years from the date of assessment to collect the balance due.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Common Timeframes Across States<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>There is no universal answer to “How long can my state collect back taxes?” because timeframes vary. Some states follow a general rule of ten years for collection, while others allow up to twenty years. A few states have even longer limits or allow extensions under specific conditions.&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Factors That Can Extend the Timeline<\/strong>&nbsp;<\/h2>\n\n\n\n<p>While the statute of limitations may offer some relief, it’s not always a guarantee. There are several circumstances that can extend or pause the clock, allowing your state more time to pursue collection efforts.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Unfiled or Fraudulent Returns<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>One of the most important exceptions involves unfiled or fraudulent returns. Most states do not start the statute of limitations clock until a tax return is filed. That means if you never submit your return, the state may have an indefinite period to assess and collect the tax.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Fraudulent filings are also treated differently. If a taxpayer files a return that contains willful misrepresentations or fraudulent intent, many states will remove any statute of limitations entirely. This allows tax authorities to pursue collection at any time in the future. For instance, California has a 20-year collection period following assessment, but if no return is filed or fraud is suspected, the statute never starts, and collection can occur decades later.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Payment Agreements or Bankruptcy<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Entering into a payment plan or installment agreement can also impact the statute of limitations. In some cases, the agreement may pause (or “toll”) the collection period while the arrangement is in place. Similarly, filing for bankruptcy can temporarily halt collection efforts under the automatic stay, but it may also extend the state’s collection window once proceedings conclude. Each state has unique rules on how these pauses are calculated, and whether they permanently extend the statute or simply delay action for a defined period.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>State-by-State Overview<\/strong>&nbsp;<\/h2>\n\n\n\n<p>Understanding your specific state’s rules is key to knowing your exposure and planning your response. Below is a detailed look at several major states, followed by a quick-reference list for all others.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>California<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>California allows a generous 20-year collection period from the date a tax is assessed. However, the California Franchise Tax Board (FTB) does not start this period until the assessment has been finalized. If no return is filed or the return is fraudulent, there is no statute of limitations, and the FTB can take action at any time.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>New York<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>The New York Department of Taxation and Finance also allows a 20-year collection period, starting from the date of formal assessment. Like California, New York has no time limit in cases involving unfiled or fraudulent returns. Notably, New York&#8217;s tax enforcement is among the most aggressive in the country, and it’s not uncommon for them to enforce debts decades after the original liability.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Texas<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Texas does not impose a personal income tax, which simplifies things for individual residents. However, businesses in Texas are subject to franchise tax. The Texas Comptroller typically has four years from the date the franchise tax report is due to conduct audits or issue assessments. If a business files a false or fraudulent tax return with the intent to evade taxes, there is no statute of limitations.&nbsp;&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Florida<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>Florida also does not have a personal income tax. For businesses, however, the state has various tax obligations such as sales tax and corporate income tax. The Florida Department of Revenue generally has three years to assess and collect tax unless the taxpayer has failed to file a return or committed fraud. In this case, the statute of limitations may not apply, or it may be significantly extended.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>Quick Reference for Other States<\/em><\/strong>&nbsp;<\/h3>\n\n\n\n<p>While tax laws can change and certain exceptions apply, the chart below provides a general overview of each state’s statutory timeframes for assessing and collecting back taxes. These figures represent typical time limits based on filed, non-fraudulent returns. In many cases, these periods are extended indefinitely if a return was never filed or fraud is suspected.&nbsp;<\/p>\n\n\n\n<p>Here is a concise summary:&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table class=\"has-fixed-layout\"><tbody><tr><td><strong>State<\/strong>&nbsp;<\/td><td><strong>Assessment Period<\/strong>&nbsp;<\/td><td><strong>Collection Period<\/strong>&nbsp;<\/td><\/tr><tr><td><strong>Alabama<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Alaska<\/strong>&nbsp;<\/td><td>No income tax&nbsp;<\/td><td>N\/A&nbsp;<\/td><\/tr><tr><td><strong>Arizona<\/strong>&nbsp;<\/td><td>4 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Arkansas<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>6 years&nbsp;<\/td><\/tr><tr><td><strong>California<\/strong>&nbsp;<\/td><td>4 years&nbsp;<\/td><td>20 years&nbsp;<\/td><\/tr><tr><td><strong>Colorado<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>6 years&nbsp;<\/td><\/tr><tr><td><strong>Connecticut<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>15 years&nbsp;<\/td><\/tr><tr><td><strong>Delaware<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>7 years&nbsp;<\/td><\/tr><tr><td><strong>Florida<\/strong>&nbsp;<\/td><td>No income tax&nbsp;<\/td><td>N\/A&nbsp;<\/td><\/tr><tr><td><strong>Georgia<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>7 years&nbsp;<\/td><\/tr><tr><td><strong>Hawaii<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Idaho<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Illinois<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>20 years&nbsp;<\/td><\/tr><tr><td><strong>Indiana&nbsp;<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Iowa<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Kansas<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Kentucky<\/strong>&nbsp;<\/td><td>4 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Louisiana<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Maine<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>6 years&nbsp;<\/td><\/tr><tr><td><strong>Maryland<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>20 years&nbsp;<\/td><\/tr><tr><td><strong>Massachusetts<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>6 years&nbsp;<\/td><\/tr><tr><td><strong>Michigan<\/strong>&nbsp;<\/td><td>4 years&nbsp;<\/td><td>6 years&nbsp;<\/td><\/tr><tr><td><strong>Minnesota<\/strong>&nbsp;<\/td><td>3.5 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Mississippi<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>7 years&nbsp;<\/td><\/tr><tr><td><strong>Missouri<\/strong>&nbsp;<\/td><td>3 years&nbsp;&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Nebraska<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Nevada<\/strong>&nbsp;<\/td><td>No income tax&nbsp;<\/td><td>N\/A&nbsp;<\/td><\/tr><tr><td><strong>New Hampshire<\/strong>&nbsp;<\/td><td>No income tax&nbsp;<\/td><td>N\/A&nbsp;<\/td><\/tr><tr><td><strong>New Jersey<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>20 years&nbsp;<\/td><\/tr><tr><td><strong>New Mexico<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>New York<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>20 years&nbsp;<\/td><\/tr><tr><td><strong>North Carolina<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>North Dakota<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Ohio<\/strong>&nbsp;<\/td><td>4 years&nbsp;<\/td><td>7 years&nbsp;<\/td><\/tr><tr><td><strong>Oklahoma<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Oregon<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Pennsylvania<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Rhode Island<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>South Carolina<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>South Dakota<\/strong>&nbsp;<\/td><td>No income tax&nbsp;<\/td><td>N\/A&nbsp;<\/td><\/tr><tr><td><strong>Tennesse<\/strong>&nbsp;<\/td><td>No income tax&nbsp;<\/td><td>N\/A&nbsp;<\/td><\/tr><tr><td><strong>Texas<\/strong>&nbsp;<\/td><td>No income tax&nbsp;<\/td><td>N\/A&nbsp;<\/td><\/tr><tr><td><strong>Utah<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>8 years&nbsp;<\/td><\/tr><tr><td><strong>Vermont<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>8 years&nbsp;<\/td><\/tr><tr><td><strong>Virginia<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>7 years&nbsp;<\/td><\/tr><tr><td><strong>Washington<\/strong>&nbsp;<\/td><td>No income tax&nbsp;<\/td><td>N\/A&nbsp;<\/td><\/tr><tr><td><strong>West Virginia<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><tr><td><strong>Wisconsin<\/strong>&nbsp;<\/td><td>4 years&nbsp;<\/td><td>6 years&nbsp;<\/td><\/tr><tr><td><strong>Wyoming<\/strong>&nbsp;<\/td><td>No income tax&nbsp;<\/td><td>N\/A&nbsp;<\/td><\/tr><tr><td><strong>District of Columbia<\/strong>&nbsp;<\/td><td>3 years&nbsp;<\/td><td>10 years&nbsp;<\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>This quick guide provides a general sense of state-level policies, but it’s important to check with your state’s Department of Revenue or consult a tax professional for the most accurate and up-to-date information.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What Happens When the Statute Expires?<\/strong>&nbsp;<\/h2>\n\n\n\n<p>If the statute of limitations for collection expires, the state tax agency is generally barred from initiating further enforcement actions such as wage garnishments, bank levies, or property liens. However, simply letting the clock run out isn’t a reliable strategy.&nbsp;<\/p>\n\n\n\n<p>In many cases, taxpayers unknowingly restart the clock by making a partial payment, entering into a new agreement, or filing an amended return. Moreover, some states require proactive steps—such as submitting a formal request for abatement—before the debt is cleared from the books. Additionally, a few states allow judgments to be renewed or tax liens to be refiled, which can extend the effect of the debt long after the statute has technically expired.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How to Check Your State’s Collection Policy<\/strong>&nbsp;<\/h2>\n\n\n\n<p>If you want to determine exactly how long your state can collect back taxes, the best starting point is your state’s Department of Revenue website. Most will have a published policy manual or legal code that outlines statutes of limitations for both assessment and collection.&nbsp;<\/p>\n\n\n\n<p>You can also request a transcript or account summary from your state tax authority, which will show assessment dates, outstanding balances, and enforcement activity. Consulting with a CPA, enrolled agent, or tax attorney is highly recommended—especially if you’re unsure whether the statute has expired or if you’ve received a recent collection notice.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Frequently Asked Questions<\/strong>&nbsp;<\/h2>\n\n\n\n<p><strong><em>Q: How far back can states go to collect taxes?<\/em><\/strong>&nbsp;<\/p>\n\n\n\n<p>A: Most states can collect back taxes for 6 to 20 years after assessment, but if you never filed a return, there’s usually no time limit—states can pursue you indefinitely.&nbsp;<\/p>\n\n\n\n<p><strong><em>Q: Can the state keep my tax refund?<\/em><\/strong>&nbsp;<\/p>\n\n\n\n<p>A: Yes, states can seize your tax refund to pay off back taxes through a process called offset, often without notice.&nbsp;<\/p>\n\n\n\n<p><strong><em>Q: Is there a statute of limitations on taxes not filed?<\/em><\/strong>&nbsp;<\/p>\n\n\n\n<p>A: No, there is no statute of limitations on unfiled tax returns—states can assess and collect taxes at any time if a return was never filed.&nbsp;<\/p>\n\n\n\n<p><strong><em>Q: How do I catch up on years of unfiled state taxes?<\/em><\/strong>&nbsp;<\/p>\n\n\n\n<p>A: To catch up, gather income records, file missing returns for required years, and work with your state to pay what you owe or set up a payment plan.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Tax Help with State Back Taxes<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The question “How long can my state collect back taxes?” has a different answer depending on where you live, whether you’ve filed a return, and whether the state believes fraud was involved. While most states have collection periods between six and twenty years after assessment, some have no time limit at all for certain violations. Understanding how your state handles back tax collection is not just about compliance—it’s about peace of mind. That said, it may be best to consult a tax professional to assist with tax relief. Affordable Tax Relief is the nation’s leading tax resolution firm with over $3 billion in resolved tax liabilities.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/p>\n\n\n\n<p><strong>If You Need Tax Help, Contact Us Today for a <\/strong><a href=\"https:\/\/app.optimataxrelief.com\/tax-problems\/?t=99&amp;utm_source=otr-blog-post&amp;utm_campaign=blog-cta&amp;adgroup=free-consultation&amp;network=otr-blogl&amp;ad=05-26-2025\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Free Consultation<\/strong><\/a>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Owing back taxes is never a pleasant situation, but it’s even more stressful when you&#8217;re unsure how long the state has to collect those taxes. While the IRS has fairly standardized time limits, the rules for state-level tax collection vary widely—and in some cases, the clock might never stop ticking. Understanding how long your state [&hellip;]<\/p>\n","protected":false},"author":8,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"off","_et_pb_old_content":"","_et_gb_content_width":"","footnotes":""},"categories":[48],"tags":[],"class_list":["post-24713","post","type-post","status-publish","format-standard","hentry","category-irs-collections"],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v25.7.1 (Yoast SEO v25.7) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How Long Can My State Collect Back Taxes?  | Affordable Tax Relief <\/title>\n<meta name=\"description\" content=\"Wondering how long your state can collect back taxes? Learn time limits, exceptions, and what stops or restarts the clock.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How Long Can My State Collect Back Taxes? \" \/>\n<meta property=\"og:description\" content=\"Wondering how long your state can collect back taxes? Learn time limits, exceptions, and what stops or restarts the clock.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/\" \/>\n<meta property=\"og:site_name\" content=\"Affordable Tax Relief \" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/OptimaTaxRelief\" \/>\n<meta property=\"article:published_time\" content=\"2025-05-30T20:00:41+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2025-06-02T17:12:12+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/how-long-state-collect-back-taxes-0525.webp\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"800\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/webp\" \/>\n<meta name=\"author\" content=\"Elyssa Carlos\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@OptimaTax\" \/>\n<meta name=\"twitter:site\" content=\"@OptimaTax\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Elyssa Carlos\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/\",\"url\":\"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/\",\"name\":\"How Long Can My State Collect Back Taxes?  | Affordable Tax Relief \",\"isPartOf\":{\"@id\":\"https:\/\/optimataxrelief.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/how-long-state-collect-back-taxes-0525-1024x512.webp\",\"datePublished\":\"2025-05-30T20:00:41+00:00\",\"dateModified\":\"2025-06-02T17:12:12+00:00\",\"description\":\"Wondering how long your state can collect back taxes? Learn time limits, exceptions, and what stops or restarts the clock.\",\"breadcrumb\":{\"@id\":\"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/#primaryimage\",\"url\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/how-long-state-collect-back-taxes-0525.webp\",\"contentUrl\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/how-long-state-collect-back-taxes-0525.webp\",\"width\":1600,\"height\":800},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/optimataxrelief.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How Long Can My State Collect Back Taxes? \"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/optimataxrelief.com\/#website\",\"url\":\"https:\/\/optimataxrelief.com\/\",\"name\":\"Affordable Tax Relief \",\"description\":\"Tax Relief &amp; Resolution - Trust the Experts at Affordable Tax Relief \",\"publisher\":{\"@id\":\"https:\/\/optimataxrelief.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/optimataxrelief.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/optimataxrelief.com\/#organization\",\"name\":\"Affordable Tax Relief , LLC\",\"url\":\"https:\/\/optimataxrelief.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg\",\"contentUrl\":\"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg\",\"width\":1,\"height\":1,\"caption\":\"Affordable Tax Relief , LLC\"},\"image\":{\"@id\":\"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/OptimaTaxRelief\",\"https:\/\/x.com\/OptimaTax\",\"https:\/\/www.youtube.com\/@OptimaTaxRelief\",\"https:\/\/www.linkedin.com\/company\/optimataxrelief\/\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"How Long Can My State Collect Back Taxes?  | Affordable Tax Relief ","description":"Wondering how long your state can collect back taxes? Learn time limits, exceptions, and what stops or restarts the clock.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/","og_locale":"en_US","og_type":"article","og_title":"How Long Can My State Collect Back Taxes? ","og_description":"Wondering how long your state can collect back taxes? Learn time limits, exceptions, and what stops or restarts the clock.","og_url":"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/","og_site_name":"Affordable Tax Relief ","article_publisher":"https:\/\/www.facebook.com\/OptimaTaxRelief","article_published_time":"2025-05-30T20:00:41+00:00","article_modified_time":"2025-06-02T17:12:12+00:00","og_image":[{"width":1600,"height":800,"url":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/how-long-state-collect-back-taxes-0525.webp","type":"image\/webp"}],"author":"Elyssa Carlos","twitter_card":"summary_large_image","twitter_creator":"@OptimaTax","twitter_site":"@OptimaTax","twitter_misc":{"Written by":"Elyssa Carlos","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/","url":"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/","name":"How Long Can My State Collect Back Taxes?  | Affordable Tax Relief ","isPartOf":{"@id":"https:\/\/optimataxrelief.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/#primaryimage"},"image":{"@id":"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/#primaryimage"},"thumbnailUrl":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/how-long-state-collect-back-taxes-0525-1024x512.webp","datePublished":"2025-05-30T20:00:41+00:00","dateModified":"2025-06-02T17:12:12+00:00","description":"Wondering how long your state can collect back taxes? Learn time limits, exceptions, and what stops or restarts the clock.","breadcrumb":{"@id":"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/#primaryimage","url":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/how-long-state-collect-back-taxes-0525.webp","contentUrl":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2025\/06\/how-long-state-collect-back-taxes-0525.webp","width":1600,"height":800},{"@type":"BreadcrumbList","@id":"https:\/\/optimataxrelief.com\/blog\/how-long-can-my-state-collect-back-taxes\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/optimataxrelief.com\/"},{"@type":"ListItem","position":2,"name":"How Long Can My State Collect Back Taxes? "}]},{"@type":"WebSite","@id":"https:\/\/optimataxrelief.com\/#website","url":"https:\/\/optimataxrelief.com\/","name":"Affordable Tax Relief ","description":"Tax Relief &amp; Resolution - Trust the Experts at Affordable Tax Relief ","publisher":{"@id":"https:\/\/optimataxrelief.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/optimataxrelief.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/optimataxrelief.com\/#organization","name":"Affordable Tax Relief , LLC","url":"https:\/\/optimataxrelief.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/","url":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg","contentUrl":"https:\/\/optimataxrelief.com\/wp-content\/uploads\/2023\/06\/OTR-logo-original-color-RGB.svg","width":1,"height":1,"caption":"Affordable Tax Relief , LLC"},"image":{"@id":"https:\/\/optimataxrelief.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/OptimaTaxRelief","https:\/\/x.com\/OptimaTax","https:\/\/www.youtube.com\/@OptimaTaxRelief","https:\/\/www.linkedin.com\/company\/optimataxrelief\/"]}]}},"_links":{"self":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts\/24713","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/users\/8"}],"replies":[{"embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/comments?post=24713"}],"version-history":[{"count":1,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts\/24713\/revisions"}],"predecessor-version":[{"id":24715,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/posts\/24713\/revisions\/24715"}],"wp:attachment":[{"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/media?parent=24713"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/categories?post=24713"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/optimataxrelief.com\/wp-json\/wp\/v2\/tags?post=24713"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}